gustavowd/FreePMU/STM32F769_EWizard/Src/tarefasPMU.c
		#if (PMU == PMU_UFSC_1) // PMU 1 UFSC
				MagR_x_mag = -0.0104230472+ 6.4799561727*Mag_R + 0.0058096119*Mag_R*Mag_R -0.0225779260*Mag_R*Mag_R*Mag_R;
				MagS_x_mag = -0.0094105471+ 6.5295808671*Mag_S -0.0517533485*Mag_S*Mag_S + 0.0122170154*Mag_S*Mag_S*Mag_S;
				MagT_x_mag = -0.0038224285+ 6.4664725524*Mag_T + 0.0200856470*Mag_T*Mag_T - 0.0147323440*Mag_T*Mag_T*Mag_T;


				//FASE
				//correcao de fase em funcao da magnitude
				// Y-data = Phase deviation - X-data = Magnitude measured (n�o em p.u.)
				faseR_x_mag = Fase_R -61.3200434278 + 0.5306019593*MagR_x_mag - 0.0359982043*MagR_x_mag*MagR_x_mag;
				faseS_x_mag = Fase_S -61.1903481072 + 0.6895729716*MagS_x_mag - 0.0945399081*MagS_x_mag*MagS_x_mag + 0.0047453058*MagS_x_mag*MagS_x_mag*MagS_x_mag;
				faseT_x_mag = Fase_T -60.7272664968 + 0.3813063315*MagT_x_mag - 0.0388992543*MagT_x_mag*MagT_x_mag + 0.0013921956*MagT_x_mag*MagT_x_mag*MagT_x_mag;

				// FREQUENCIA
				//correcao de fase em funcao da frequencia
				// Y-data = phase deviation - X-data = frequency reference
				faseR_x_freq = -2.7531705491 + 0.0512209453*Freq_final;
				faseS_x_freq = -2.3592039210 + 0.0477269049*Freq_final;
				faseT_x_freq = -2.6454608536 + 0.0538034619*Freq_final;

				// Calcula magnitude final
				// Ajustes do ganho de magnitude:
				// Sensor AZUL:
				Mag_R_final = MagR_x_mag * 42.5038; //Mag_R;
				Mag_S_final = MagS_x_mag * 42.1823;
				Mag_T_final = MagT_x_mag * 42.5782; //MagT_x_mag;
		#endif
		#if (PMU == PMU_UFSC_2)  // PMU 2 UFSC
				MagR_x_mag = -0.0016362996 + 6.4330443785*Mag_R + 0.0658874232*Mag_R*Mag_R - 0.0351025233*Mag_R*Mag_R*Mag_R;
				MagS_x_mag = 0.0009628812 + 6.3757106266*Mag_S +0.0686457110*Mag_S*Mag_S -0.0299965117*Mag_S*Mag_S*Mag_S;
				MagT_x_mag = 0.0004282697 + 6.4019875313*Mag_T + 0.0981472053*Mag_T*Mag_T -0.0467723654*Mag_T*Mag_T*Mag_T;

				//FASE
				//correcao de fase em funcao da magnitude
				// Y-data = Phase deviation - X-data = Magnitude measured (n�o em p.u.)

				faseR_x_mag = Fase_R - 60.256916502 + 0.1863745932*MagR_x_mag - 0.0076768782*MagR_x_mag*MagR_x_mag;
				faseS_x_mag = Fase_S - 60.273407182 + 0.2463213789*MagS_x_mag - 0.0144579474*MagS_x_mag*MagS_x_mag;
				faseT_x_mag = Fase_T - 60.271458135 + 0.1695834628*MagT_x_mag - 0.0045740754*MagT_x_mag*MagT_x_mag;

				// FREQUENCIA
				//correcao de fase em funcao da frequencia
				// Y-data = phase deviation - X-data = frequency reference
				faseR_x_freq = -2.5770186918 + 0.0521374904*Freq_final;
				faseS_x_freq = -2.6741303661 + 0.0537621928*Freq_final;
				faseT_x_freq = -2.3885333996 + 0.0485053178*Freq_final;

				// Calcula magnitude final
				// Ajustes do ganho de magnitude:
				// Sensor AZUL:
				Mag_R_final = MagR_x_mag * 42.3832; //Mag_R;
				Mag_S_final = MagS_x_mag * 42.4718;
				Mag_T_final = MagT_x_mag * 42.45794; //MagT_x_mag;
		#endif


		//Calcula fase final (aplica as correcoes anteriores)
		Fase_R_final = faseR_x_mag + faseR_x_freq;
		Fase_S_final = faseS_x_mag + faseS_x_freq;
		Fase_T_final = faseT_x_mag + faseT_x_freq;

		// Correcao da regiao de 180 graus para a fase final
		if(Fase_R_final > 180.0){
			Fase_R_final = (Fase_R_final-360);
		}
		if(Fase_R_final <= -180.0){
			Fase_R_final = (Fase_R_final+360);
		}
		if(Fase_S_final>180.0){
			Fase_S_final = (Fase_S_final-360);
		}
		if(Fase_S_final<= -180.0){
			Fase_S_final = (Fase_S_final+360);
		}
		if(Fase_T_final>180.0){
			Fase_T_final = (Fase_T_final-360);
		}
		if(Fase_T_final<= -180.0){
			Fase_T_final = (Fase_T_final+360);
		}


	#ifdef PLATAFORMA_DE_TESTES
		// DADOS DA TRANSMISSAO (via serial pro PC)
		buffer[0] = Mag_R_final;
		buffer[1] = Fase_R_final;
		buffer[2] = Freq_final;
		buffer[3] = media_rocof;

		// Envia os dados pela serial
		uint8_t *dados = (uint8_t*)&buffer;
		UARTPutString(dados,16);
	#endif

	#ifdef PPS_30_HZ
		if (frame_cnt){
			FracSec += FRACAO_DE_SEGUNDO;
			if (FracSec > 0xEC001){
				taskENTER_CRITICAL();
				newSOC = 0;
				FracSec = 0;
				taskEXIT_CRITICAL();
			}
		}else{
			FracSec = FRACAO_DE_SEGUNDO_INIT;
		}

		frame_cnt++;
		if (frame_cnt >= (NOMINAL_FREQ/2)){
			frame_cnt = 0;
		}
	#endif

		if((isSyncCreated == 1) && (data_flag)){
				cnt = 0;
				osSemaphoreRelease(syncSem_id);

		}
		BSP_LED_Toggle(LED1);

	}
}




extern xSemaphoreHandle sUART;
char teste;

void GPS_Task(void const * argument)
{

	osMessageQDef(SerialGPSq, 128, unsigned char);
	SerialGPSq = osMessageCreate(osMessageQ(SerialGPSq), NULL);


	sUART = xSemaphoreCreateBinary();
	MX_USART6_UART_Init();
	HAL_UART_Receive_IT(&huart6, (uint8_t*)&teste, 1);

	while(1){
	    volatile unsigned char *p;

		p = (unsigned char*)&dado_gps;

		/*Liga o GPS*/
		HAL_GPIO_WritePin(GPIOJ, GPIO_PIN_1, GPIO_PIN_SET);

		do{
			UARTGetChar(&huart6, (uint8_t*)p, osWaitForever);
		  }while(*p != '$');

		p--;

		do{
		   p++;
		   UARTGetChar(&huart6, (uint8_t*)p, osWaitForever);
		}while(*p != '\n');

		#if GPS_PROTOCOL == GPS_NMEA
		uint8_t date_calc = 0;
		uint8_t valid_data = 0;
		uint8_t hora_calc = 0;
		uint8_t substring=1;
		struct tm t;

		char* str = strtok(dado_gps, ",");

		/*Verifica se chegou informações de Data e Hora*/
		if (strcmp(str, "GPRMC\0") != 0){
			substring = 10; /*Se a mensagem recebida não for correta*/
		}
		str+=6;

		while (substring <=9){
			if (substring == 1 && *str != ','){
				t.tm_hour = 10*( *str++ - 48);
				t.tm_hour += (*str++ - 48);
				t.tm_min = 10*(*str++ - 48);
				t.tm_min += (*str++ - 48);
				t.tm_sec = 10*(*str++ - 48);
				t.tm_sec += (*str++ - 48);
				hora_calc = 1;
			}else if (substring ==2 && *str != ','){
				if (*str++ == 'A')
					valid_data=1;
			}
			else if (substring == 9 && *str != ','){
				t.tm_mday = 10*( *str++ - 48);
				t.tm_mday += ( *str++ - 48);
				t.tm_mon = 10*( *str++ - 48);
				t.tm_mon += ( *str++ - 48) - 1;
				t.tm_year = 2000+10*( *str++ - 48);
				t.tm_year += ( *str++  - 48) - 1900;
				t.tm_isdst = -1;
				date_calc = 1;
			}

			while (*str++ != ',');
			substring++;
		}

		/*Verifica se chegou informações de Data e Hora*/
		if (date_calc && hora_calc && valid_data){

			//char m[80];
			//sprintf(m, "%d:%d:%d - %d/%d/%d\n", t.tm_hour, t.tm_min, t.tm_sec,
			//		                            t.tm_mday, t.tm_mon+1, t.tm_year+1900 );
			//EwPrint(m);

			/*segundo secular UNIX time (1 jan 1970)*/
			SOC = (unsigned long) mktime(&t);

