gustavowd/FreePMU/STM32F769_EWizard/Src/tarefasPMU.c
	// 12. CRC-CCITT = Cyclic Redundancy Codes (CRC)
	CRC_CCITT = ComputeCRC(ucData, i);

	ucData[i++] = (unsigned char)((CRC_CCITT & 0xFF00) >> 8);	//48
	ucData[i++] = (unsigned char)(CRC_CCITT & 0x00FF);			//49

	//HAL_GPIO_TogglePin(GPIOF, GPIO_PIN_6);

	/*Novo SOC foi calculado*/
	if (newSOC) {
		//Se a fila estiver vazia ...
		if (isQueueEmpty(qUcData)) {
			/*	... Retorna 1, informando o pmu_tcp_server_out
			 *  pra apenas enviar o ucData atual, visto que nao tem
			 	mais dados que este para enviar. */
			return 1;
		}
		else {
			/*	... coloca o newSOC em todos os elementos da fila
			 *  para serem enviados pelo tcp_server.
			 *
			 *  Lembrando que a funcao changeSOC retorna o numero de elementos
			 *  da fila, por isso se encontra em um return. */
			insertQueueElement(qUcData, ucData);
			return changeSOC(qUcData, SOC);
		}
	}
	else {   /* Nao ha SOC calculado, guarda na fila e retorna 0, nada para ser enviado*/
		#ifndef PPS_30_HZ		
		if (isQueueEmpty(qUcData)){
			FracSec = 0x00;
			ucData[10] = (unsigned char)((FracSec & 0xFF000000) >> 24);  //10 - Time quality (secao 6.2.2)
			ucData[11] = (unsigned char)((FracSec & 0x00FF0000) >> 16);  //11 - fracsec
			ucData[12] = (unsigned char)((FracSec & 0x0000FF00) >> 8);   //12 - fracsec
			ucData[13] = (unsigned char)(FracSec & 0x000000FF);		  //13 - fracsec
			FracSec += 0x00008235;
		}
		#endif
		insertQueueElement(qUcData, ucData);
		return 0;
	}
}

/////////////// FRAME DE CONFIGURACAO
int frame_config(void){
	char CHName[16]; //vetor nome dos canais, frame config

	memset(ucData, 0x00, sizeof(ucData));

	// 1. SYNC = Data Message Sync Byte andFrame Type
	ucData[0] = A_SYNC_AA;
	ucData[1] = A_SYNC_CFG2;

	// 2. FRAMESIZE = Tamanho do frame, incluindo CHK
	ucData[2] = (unsigned char)0x00;
	ucData[3] = (unsigned char)0x72; //

	// 3. IDCODE = ID da fonte de transmissao
	ucData[4] = (unsigned char)((PmuID & 0xFF00) >> 8);
	ucData[5] = (unsigned char)(PmuID & 0x00FF);

	// 4. SOC = Second Of Century = Estampa de tempo, segundo secular
	ucData[6] = (unsigned char)((SOC & 0xFF000000) >> 24);
	ucData[7] = (unsigned char)((SOC & 0x00FF0000) >> 16);
	ucData[8] = (unsigned char)((SOC & 0x0000FF00) >> 8);
	ucData[9] = (unsigned char)(SOC & 0x000000FF);

	// 5. FRACSEC = Fracao do segundo e qualidade do tempo
	ucData[10] = (unsigned char)((FracSec & 0xFF000000) >> 24);  //Time quality (secao 6.2.2)
	ucData[11] = (unsigned char)((FracSec & 0x00FF0000) >> 16);  //fracsec
	ucData[12] = (unsigned char)((FracSec & 0x0000FF00) >> 8);   //fracsec
	ucData[13] = (unsigned char)(FracSec & 0x000000FF);			//fracsec

	// 6. TIME_BASE = Resolucao do FRACSEC
	ucData[14] = (unsigned char)((Time_base & 0xFF000000) >> 24);
	ucData[15] = (unsigned char)((Time_base & 0x00FF0000) >> 16);
	ucData[16] = (unsigned char)((Time_base & 0x0000FF00) >> 8);
	ucData[17] = (unsigned char)(Time_base & 0x000000FF);

	// 7. NUM_PMU = numero de PMUs inclusas no frame de dados
	ucData[18] = 0x00;
	ucData[19] = 0x01;

	// 8. STN = Nome da estacao
	//Exemplo: "Station A" = 53 74 61 74 69 6F 6E 20 41 20 20 20 20 20 20 20
	ucData[20] = 0x53;
	ucData[21] = 0x74;
	ucData[22] = 0x61;
	ucData[23] = 0x74;
	ucData[24] = 0x69;
	ucData[25] = 0x6F;
	ucData[26] = 0x6E;
	ucData[27] = 0x20;
	ucData[28] = 0x41;
	ucData[29] = 0x20;
	ucData[30] = 0x20;
	ucData[31] = 0x20;
	ucData[32] = 0x20;
	ucData[33] = 0x20;
	ucData[34] = 0x20;
	ucData[35] = 0x20;

	// 9. IDCODE = uma PMU, nesse caso igual ao campo 3
	ucData[36] = (unsigned char)((PmuID & 0xFF00) >> 8);
	ucData[37] = (unsigned char)(PmuID & 0x00FF);

	// 10. FORMAT = Formato dos dados nos frames de dados
	ucData[38] = 0x00;
	ucData[39] = 0x0F;  // 0111b

	// 11. PHNMR = Numero de fasores
	ucData[40] = 0x00;
	ucData[41] = 0x03;  // 3 fasores

	// 12. ANNMR = Number of Analog Values
	ucData[42] = 0x00;
	ucData[43] = 0x00;  //

	// 13. DGNMR = Number of Digital Status Words
	ucData[44] = 0x00;
	ucData[45] = 0x00;

	// 14. CHNAM = Nome de fasores e canais

	memset(CHName, 0x00, 16);
	strcpy(CHName, "Fase_A");
	memcpy(ucData + 46, CHName, 16);

	memset(CHName, 0x00, 16);
	strcpy(CHName, "Fase_B");
	memcpy(ucData + 62, CHName, 16);

	memset(CHName, 0x00, 16);
	strcpy(CHName, "Fase_C");
	memcpy(ucData + 78, CHName, 16);

	int i = 94;
	// 15.  PHUNIT = fator de conversao pra canais fasoriais
	// 4 bytes pra cada fasor
	ucData[i++] = 0x00;  // 0 = Voltage, 1 = Current
	ucData[i++] = 0x00;  // ignore
	ucData[i++] = 0x00;  // ignore
	ucData[i++] = 0x00;  // ignore

	ucData[i++] = 0x00;  //
	ucData[i++] = 0x00;  //
    ucData[i++] = 0x00;  //
	ucData[i++] = 0x00;  //

	ucData[i++] = 0x00;
	ucData[i++] = 0x00;
	ucData[i++] = 0x00;  //
	ucData[i++] = 0x00;  //

	// 18. FNOM = Frequencia nominal
	ucData[i++] = 0x00;

	if(f0 == 50){
		ucData[i++] = 0x01; // 1 = 50 Hz
	 }else{
		 ucData[i++] = 0x00; // 0 = 60 Hz
	 }

	// 19. CFGCNT = contador de alteracao da configuracao
	ucData[i++] = 0x00;
	ucData[i++] = 0x00;  //

	// 20. DATA_RATE = Taxa de transmissao de fasores
	ucData[i++] = ((fps & 0xFF00) >> 8);
	ucData[i++] = (fps & 0x00FF);

	//21. CRC-CCITT = Calcula o CRC

	CRC_CCITT = ComputeCRC(ucData, i);

	ucData[i++] = (unsigned char)((CRC_CCITT & 0xFF00) >> 8);
	ucData[i++] = (unsigned char)(CRC_CCITT & 0x00FF);

	return i;
}


///////////////// FRAME DE CABECALHO
int frame_header(void)
{

	//unsigned char ucData[20];

	// 1. SYNC = Data Message Sync Byte andFrame Type
	ucData[0] = A_SYNC_AA;
	ucData[1] = A_SYNC_HDR;

	// 2. FRAMESIZE = Tamanho do frame, incluindo CHK
	ucData[2] = (unsigned char)0x00;
	ucData[3] = (unsigned char)0x15; // 21 em decimal

	// 3. IDCODE = ID da fonte de transmissao
	ucData[4] = (unsigned char)((PmuID & 0xFF00) >> 8);
	ucData[5] = (unsigned char)(PmuID & 0x00FF);

	// 4. SOC = Second Of Century = Estampa de tempo, segundo secular
	ucData[6] = (unsigned char)((SOC & 0xFF000000) >> 24);
	ucData[7] = (unsigned char)((SOC & 0x00FF0000) >> 16);
	ucData[8] = (unsigned char)((SOC & 0x0000FF00) >> 8);
	ucData[9] = (unsigned char)(SOC & 0x000000FF);

	// 5. FRACSEC = Fracao do segundo e qualidade do tempo
	ucData[10] = (unsigned char)((FracSec & 0xFF000000) >> 24);  //Time quality (secao 6.2.2)
	ucData[11] = (unsigned char)((FracSec & 0x00FF0000) >> 16);  //fracsec
	ucData[12] = (unsigned char)((FracSec & 0x0000FF00) >> 8);   //fracsec
	ucData[13] = (unsigned char)(FracSec & 0x000000FF);			//fracsec

